Pandas
參考資料: https://www.zhihu.com/column/c_1208097472842735616

In [17]:
import pandas as pd
import numpy as np

In [2]:
#創建一維陣列
s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)
type(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

pandas.core.series.Series

In [3]:
#生成日期序列
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
#隨機生成dataframe
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.704412 -0.202374  0.271634  1.579971
2013-01-02 -0.197372  1.799663  0.400207 -0.404169
2013-01-03 -1.267535 -0.282954  2.114826  0.020538
2013-01-04  0.305606  0.262804 -0.089544  2.116613
2013-01-05 -0.099190 -0.362426 -1.215431 -1.068412
2013-01-06  1.362522 -0.064041 -0.054320 -1.402565

In [5]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]), #類別變數
        "F": "foo",
    }
)

print(df2)
df2.dtypes

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [6]:
df.head()
df.tail()
df.index #抓row name
df.columns #抓col name

Index(['A', 'B', 'C', 'D'], dtype='object')

In [7]:
# df轉array
df.to_numpy()

# 注意: 如果df內的col有不同的type，則轉換會很慢沒效率，因為array中都要是同一種type
# 注意: does not include the index or column labels in the output.

array([[ 0.70441246, -0.20237394,  0.2716339 ,  1.57997074],
       [-0.19737219,  1.79966278,  0.40020678, -0.40416888],
       [-1.26753459, -0.28295435,  2.11482608,  0.02053755],
       [ 0.30560594,  0.26280423, -0.08954394,  2.11661338],
       [-0.09918999, -0.36242585, -1.21543051, -1.06841181],
       [ 1.3625218 , -0.06404147, -0.05432023, -1.40256521]])

In [8]:
#Summary the df
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.134741  0.191779  0.237895  0.140329
std    0.893596  0.817759  1.082138  1.423424
min   -1.267535 -0.362426 -1.215431 -1.402565
25%   -0.172827 -0.262809 -0.080738 -0.902351
50%    0.103208 -0.133208  0.108657 -0.191816
75%    0.604711  0.181093  0.368064  1.190112
max    1.362522  1.799663  2.114826  2.116613

In [9]:
#Transpose
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.704412   -0.197372   -1.267535    0.305606   -0.099190    1.362522
B   -0.202374    1.799663   -0.282954    0.262804   -0.362426   -0.064041
C    0.271634    0.400207    2.114826   -0.089544   -1.215431   -0.054320
D    1.579971   -0.404169    0.020538    2.116613   -1.068412   -1.402565

In [10]:
#依照index(rownames or colnames)進行排序
df.sort_index(axis=1, ascending=False) #axis=0: 依照rownames, axis=1: 依照colnames

#依照value進行排序
df.sort_values(by='B')

                   A         B         C         D
2013-01-05 -0.099190 -0.362426 -1.215431 -1.068412
2013-01-03 -1.267535 -0.282954  2.114826  0.020538
2013-01-01  0.704412 -0.202374  0.271634  1.579971
2013-01-06  1.362522 -0.064041 -0.054320 -1.402565
2013-01-04  0.305606  0.262804 -0.089544  2.116613
2013-01-02 -0.197372  1.799663  0.400207 -0.404169

In [11]:
#Selection

In [12]:
# 選擇單一col
df['A']

2013-01-01    0.704412
2013-01-02   -0.197372
2013-01-03   -1.267535
2013-01-04    0.305606
2013-01-05   -0.099190
2013-01-06    1.362522
Freq: D, Name: A, dtype: float64

In [13]:
#選取指定範圍的row
df[0:2] #選取第0、1列，不包含尾段
df['2013-01-01':'2013-01-03'] #選取第0、1、2列，包含尾段

                   A         B         C         D
2013-01-01  0.704412 -0.202374  0.271634  1.579971
2013-01-02 -0.197372  1.799663  0.400207 -0.404169
2013-01-03 -1.267535 -0.282954  2.114826  0.020538

In [14]:
# 同時篩選col & row，要加上loc

#抓出index符合條件的row
df.loc[dates[0]]

A    0.704412
B   -0.202374
C    0.271634
D    1.579971
Name: 2013-01-01 00:00:00, dtype: float64

In [15]:
df.loc[:, ['A', 'B']]

df.loc["20130102":"20130104", ["A", "D"]]

                   A         D
2013-01-02 -0.197372 -0.404169
2013-01-03 -1.267535  0.020538
2013-01-04  0.305606  2.116613

In [16]:
# Selecting by position
# 用編號選擇row 或 col

#選擇row
df.iloc[3]

#選擇row & col
df.iloc[0:2, 2:4]

#或用list指定不連續位置
df.iloc[[0,2], [1, 3]]

                   B         D
2013-01-01 -0.202374  1.579971
2013-01-03 -0.282954  0.020538

In [17]:
# Boolean indexing

In [18]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  0.704412 -0.202374  0.271634  1.579971
2013-01-04  0.305606  0.262804 -0.089544  2.116613
2013-01-06  1.362522 -0.064041 -0.054320 -1.402565

In [19]:
df[df>0]

                   A         B         C         D
2013-01-01  0.704412       NaN  0.271634  1.579971
2013-01-02       NaN  1.799663  0.400207       NaN
2013-01-03       NaN       NaN  2.114826  0.020538
2013-01-04  0.305606  0.262804       NaN  2.116613
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06  1.362522       NaN       NaN       NaN

Filter

In [20]:
df2 = df.copy() #不會更改原本的df
# df2 = df #會更改原本的df，使得df == df2

df2['E'] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01  0.704412 -0.202374  0.271634  1.579971    one
2013-01-02 -0.197372  1.799663  0.400207 -0.404169    one
2013-01-03 -1.267535 -0.282954  2.114826  0.020538    two
2013-01-04  0.305606  0.262804 -0.089544  2.116613  three
2013-01-05 -0.099190 -0.362426 -1.215431 -1.068412   four
2013-01-06  1.362522 -0.064041 -0.054320 -1.402565  three

In [21]:
#利用isin()，filter出特定條件的row
df2[df2['E'].isin(['one', 'three'])]

                   A         B         C         D      E
2013-01-01  0.704412 -0.202374  0.271634  1.579971    one
2013-01-02 -0.197372  1.799663  0.400207 -0.404169    one
2013-01-04  0.305606  0.262804 -0.089544  2.116613  three
2013-01-06  1.362522 -0.064041 -0.054320 -1.402565  three

Setting (更改特定位置數值)

In [22]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

df['F'] = s1
df

                   A         B         C         D    F
2013-01-01  0.704412 -0.202374  0.271634  1.579971  NaN
2013-01-02 -0.197372  1.799663  0.400207 -0.404169  1.0
2013-01-03 -1.267535 -0.282954  2.114826  0.020538  2.0
2013-01-04  0.305606  0.262804 -0.089544  2.116613  3.0
2013-01-05 -0.099190 -0.362426 -1.215431 -1.068412  4.0
2013-01-06  1.362522 -0.064041 -0.054320 -1.402565  5.0

In [23]:
df.loc[dates[0], 'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.202374  0.271634  1.579971  NaN
2013-01-02 -0.197372  1.799663  0.400207 -0.404169  1.0
2013-01-03 -1.267535 -0.282954  2.114826  0.020538  2.0
2013-01-04  0.305606  0.262804 -0.089544  2.116613  3.0
2013-01-05 -0.099190 -0.362426 -1.215431 -1.068412  4.0
2013-01-06  1.362522 -0.064041 -0.054320 -1.402565  5.0

In [24]:
df['D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000 -0.202374  0.271634  5  NaN
2013-01-02 -0.197372  1.799663  0.400207  5  1.0
2013-01-03 -1.267535 -0.282954  2.114826  5  2.0
2013-01-04  0.305606  0.262804 -0.089544  5  3.0
2013-01-05 -0.099190 -0.362426 -1.215431  5  4.0
2013-01-06  1.362522 -0.064041 -0.054320  5  5.0

Missing value 遺漏值

In [25]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

df1.loc[dates[0] : dates[1], "E"] = 1

df1

                   A         B         C  D    F    E
2013-01-01  0.000000 -0.202374  0.271634  5  NaN  1.0
2013-01-02 -0.197372  1.799663  0.400207  5  1.0  1.0
2013-01-03 -1.267535 -0.282954  2.114826  5  2.0  NaN
2013-01-04  0.305606  0.262804 -0.089544  5  3.0  NaN

In [26]:
# 移除具有NA的row (na.omit)
df1.dropna(how='any') #how='all': 整個row或col都是NA才會去除

                   A         B         C  D    F    E
2013-01-02 -0.197372  1.799663  0.400207  5  1.0  1.0

In [27]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000 -0.202374  0.271634  5  5.0  1.0
2013-01-02 -0.197372  1.799663  0.400207  5  1.0  1.0
2013-01-03 -1.267535 -0.282954  2.114826  5  2.0  5.0
2013-01-04  0.305606  0.262804 -0.089544  5  3.0  5.0

In [28]:
df1.isna()

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [29]:
#Operation

In [30]:
df.mean() #by col 做mean

df.mean(axis=1) #by row 做mean

# 注意: 如果有nan，都會被忽略

2013-01-01    1.267315
2013-01-02    1.600499
2013-01-03    1.512867
2013-01-04    1.695773
2013-01-05    1.464591
2013-01-06    2.248832
Freq: D, dtype: float64

In [31]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [32]:
# df - s by row，因為維度不一樣，python會brodcast到相同維度
df.sub(s, axis=0)

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.267535 -1.282954  1.114826  4.0  1.0
2013-01-04 -2.694394 -2.737196 -3.089544  2.0  0.0
2013-01-05 -5.099190 -5.362426 -6.215431  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

Map
利用字典映射去替換值

In [33]:
boolean = [True,False]
gender = ["男","女"]
color = ["white","black","yellow"]
data = pd.DataFrame({
    "height":np.random.randint(150,190,100),
    "weight":np.random.randint(40,90,100),
    "smoker":[boolean[x] for x in np.random.randint(0,2,100)],
    "gender":[gender[x] for x in np.random.randint(0,2,100)],
    "age":np.random.randint(15,90,100),
    "color":[color[x] for x in np.random.randint(0,len(color),100) ]
})

data

    height  weight  smoker gender  age   color
0      159      89    True      男   42   black
1      181      75   False      女   84   black
2      187      45    True      女   65   black
3      161      59   False      女   68   white
4      168      61   False      男   60   white
..     ...     ...     ...    ...  ...     ...
95     184      46   False      女   43   white
96     182      59   False      女   86  yellow
97     157      86   False      男   59  yellow
98     154      62    True      女   69   black
99     151      51   False      女   48   white

[100 rows x 6 columns]

In [34]:
# 男的換成1，女的換成0
data['gender'] = data['gender'].map({'男':1, '女':0})
data

    height  weight  smoker  gender  age   color
0      159      89    True       1   42   black
1      181      75   False       0   84   black
2      187      45    True       0   65   black
3      161      59   False       0   68   white
4      168      61   False       1   60   white
..     ...     ...     ...     ...  ...     ...
95     184      46   False       0   43   white
96     182      59   False       0   86  yellow
97     157      86   False       1   59  yellow
98     154      62    True       0   69   black
99     151      51   False       0   48   white

[100 rows x 6 columns]

apply
對行或是列進行function操作

In [35]:
def apply_age(x, bias):
    return x + bias

# 以元组的方式传入额外的参数
data["age"] = data["age"].apply(apply_age, args = (-3, ))
data

    height  weight  smoker  gender  age   color
0      159      89    True       1   39   black
1      181      75   False       0   81   black
2      187      45    True       0   62   black
3      161      59   False       0   65   white
4      168      61   False       1   57   white
..     ...     ...     ...     ...  ...     ...
95     184      46   False       0   40   white
96     182      59   False       0   83  yellow
97     157      86   False       1   56  yellow
98     154      62    True       0   66   black
99     151      51   False       0   45   white

[100 rows x 6 columns]

In [36]:
# axis=0: 對col做function運算
data[["height","weight","age"]].apply(np.sum, axis=0)

height    16941
weight     6386
age        5100
dtype: int64

In [37]:
data[["height","weight","age"]].apply(np.log, axis=0)

      height    weight       age
0   5.068904  4.488636  3.663562
1   5.198497  4.317488  4.394449
2   5.231109  3.806662  4.127134
3   5.081404  4.077537  4.174387
4   5.123964  4.110874  4.043051
..       ...       ...       ...
95  5.214936  3.828641  3.688879
96  5.204007  4.077537  4.418841
97  5.056246  4.454347  4.025352
98  5.036953  4.127134  4.189655
99  5.017280  3.931826  3.806662

[100 rows x 3 columns]

In [41]:
def BMI(series):
    weight = series["weight"]
    height = series["height"]/100
    BMI = weight/height**2
    return BMI

data["BMI"] = data.apply(BMI,axis=1)
data.head()

   height  weight  smoker  gender  age  color        BMI
0     159      89    True       1   39  black  35.204304
1     181      75   False       0   81  black  22.893074
2     187      45    True       0   62  black  12.868541
3     161      59   False       0   65  white  22.761468
4     168      61   False       1   57  white  21.612812

Histogramming

In [67]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    6
1    4
2    1
3    2
4    6
5    2
6    2
7    0
8    1
9    6
dtype: int32

In [68]:
#計算每個value出現的次數
s.value_counts()

6    3
2    3
1    2
4    1
0    1
dtype: int64

string 操作

In [72]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [73]:
#全部轉小寫
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

Merge 合併資料

In [5]:
# inner join
import pandas as pd

df1 = pd.DataFrame({
    'userid':('a', 'b', 'c', 'd'), 
    'age':(23, 46, 32, 19)})

df2 = pd.DataFrame({
    'userid':('a', 'c'), 
    'payment':(2000, 3500)})

print(df1)
print(df2)

  userid  age
0      a   23
1      b   46
2      c   32
3      d   19
  userid  payment
0      a     2000
1      c     3500

In [6]:
df1.merge(df2, how='inner', on='userid')

  userid  age  payment
0      a   23     2000
1      c   32     3500

In [7]:
# another inner join
df1 = pd.DataFrame({
    'userid':('a', 'b', 'c', 'd'), 
    'age':(23, 46, 32, 19)})

df2 = pd.DataFrame({
    'userid':('a', 'c', 'a', 'b'), 
    'payment':(2000, 3500, 500, 1000)})

print(df1)
print(df2)

  userid  age
0      a   23
1      b   46
2      c   32
3      d   19
  userid  payment
0      a     2000
1      c     3500
2      a      500
3      b     1000

In [8]:
df1.merge(df2, how='inner', on='userid')

  userid  age  payment
0      a   23     2000
1      a   23      500
2      b   46     1000
3      c   32     3500

In [9]:
# left or right join
df1 = pd.DataFrame({
    'userid':('a', 'b', 'c', 'd'), 
    'age':(23, 46, 32, 19)})

df2 = pd.DataFrame({
    'userid':('a', 'c', 'e'), 
    'payment':(2000, 3500, 500)})

print(df1)
print(df2)

  userid  age
0      a   23
1      b   46
2      c   32
3      d   19
  userid  payment
0      a     2000
1      c     3500
2      e      500

In [11]:
# 若不存在表格中則會填充NaN
df1.merge(df2, how='left', on='userid')

  userid  age  payment
0      a   23   2000.0
1      b   46      NaN
2      c   32   3500.0
3      d   19      NaN

In [12]:
# outer join
df1 = pd.DataFrame({
    'userid':('a', 'b', 'c', 'd'), 
    'age':(23, 46, 32, 19)})

df2 = pd.DataFrame({
    'userid':('a', 'c', 'e'), 
    'payment':(2000, 3500, 500)})

print(df1)
print(df2)

  userid  age
0      a   23
1      b   46
2      c   32
3      d   19
  userid  payment
0      a     2000
1      c     3500
2      e      500

In [13]:
df1.merge(df2, how='outer', on='userid')

  userid   age  payment
0      a  23.0   2000.0
1      b  46.0      NaN
2      c  32.0   3500.0
3      d  19.0      NaN
4      e   NaN    500.0

In [19]:
# concat
df = pd.DataFrame(np.random.randn(10, 4), columns=list("ABCD"))

pieces = [df[:3], df[3:7], df[7:]] #用list把原始df拆成3段
pieces

[          A         B         C         D
 0  1.804201  1.321380  1.299373 -0.194148
 1 -0.750321  0.337029 -0.216595 -0.441374
 2  1.987110 -0.521404  0.184487  0.779122,
           A         B         C         D
 3 -0.793904  1.153067 -2.677496 -0.790785
 4  0.212631 -0.770354 -0.640088 -0.424750
 5 -1.322150  0.325483 -0.491797  0.564116
 6 -0.877250 -1.067326  0.407882  1.075910,
           A         B         C         D
 7 -0.111054 -0.008735 -1.832597  0.009492
 8  0.885781  1.762027 -0.271104  0.545951
 9  0.219385  1.601550 -0.423143 -0.043667]

In [22]:
pd.concat(pieces, axis=0) #axis=0:rbind, axis=1:cbind

# 注意: 添加col速度比較快，若是要添加row會慢很多，因此建議先創建一個list，append要合併的row，之後將list concat起來再合併回去df，速度會較快

          A         B         C         D
0  1.804201  1.321380  1.299373 -0.194148
1 -0.750321  0.337029 -0.216595 -0.441374
2  1.987110 -0.521404  0.184487  0.779122
3 -0.793904  1.153067 -2.677496 -0.790785
4  0.212631 -0.770354 -0.640088 -0.424750
5 -1.322150  0.325483 -0.491797  0.564116
6 -0.877250 -1.067326  0.407882  1.075910
7 -0.111054 -0.008735 -1.832597  0.009492
8  0.885781  1.762027 -0.271104  0.545951
9  0.219385  1.601550 -0.423143 -0.043667

Reshaping (橫轉直 or 直轉橫)

待補充 (stack、unstack)

Pivot tables (樞紐分析表)

In [25]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

df

        A  B    C         D         E
0     one  A  foo  1.040899  0.292678
1     one  B  foo -0.527848  0.676057
2     two  C  foo -0.447077 -0.998864
3   three  A  bar  0.654545 -1.283648
4     one  B  bar -0.500400 -0.026889
5     one  C  bar  0.791473 -0.863573
6     two  A  foo -1.516728 -1.065075
7   three  B  foo  1.593160 -0.182908
8     one  C  foo -0.019730 -0.163008
9     one  A  bar -1.052775 -1.898877
10    two  B  bar -0.073501  0.978548
11  three  C  bar -0.126212 -0.475674

In [26]:
df.pivot_table(index=['A', 'B'], columns='C', values='D', aggfunc=np.mean) #default: aggfunc='mean'

C             bar       foo
A     B
one   A -1.052775  1.040899
      B -0.500400 -0.527848
      C  0.791473 -0.019730
three A  0.654545       NaN
      B       NaN  1.593160
      C -0.126212       NaN
two   A       NaN -1.516728
      B -0.073501       NaN
      C       NaN -0.447077

Time series

In [45]:
# dtype 轉成 datetime
df = pd.DataFrame({'date':range(20190101, 20190110)})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    9 non-null      int64
dtypes: int64(1)
memory usage: 200.0 bytes

In [46]:
df['date'] = pd.to_datetime(df['date'], format="%Y%m%d")
df

        date
0 2019-01-01
1 2019-01-02
2 2019-01-03
3 2019-01-04
4 2019-01-05
5 2019-01-06
6 2019-01-07
7 2019-01-08
8 2019-01-09

In [40]:
#利用索引調用資料
df2 = pd.DataFrame({
    'value':range(0, 100)
}, index=pd.date_range("20130101", periods=100))
df2

            value
2013-01-01      0
2013-01-02      1
2013-01-03      2
2013-01-04      3
2013-01-05      4
...           ...
2013-04-06     95
2013-04-07     96
2013-04-08     97
2013-04-09     98
2013-04-10     99

[100 rows x 1 columns]

In [41]:
df2.loc["2013-02"].head()

            value
2013-02-01     31
2013-02-02     32
2013-02-03     33
2013-02-04     34
2013-02-05     35

In [44]:
df2.loc["2013-02":"2013-04"]

            value
2013-02-01     31
2013-02-02     32
2013-02-03     33
2013-02-04     34
2013-02-05     35
...           ...
2013-04-06     95
2013-04-07     96
2013-04-08     97
2013-04-09     98
2013-04-10     99

[69 rows x 1 columns]

In [ ]:
# dtype是datetime的形式後，利用dt調用需要的資訊
# year
# month
# day
# hour
# mintue
# second
# date
# time
# dayofyear:一年中的第幾天
# weekofyear:一年中的第幾個禮拜
# weekday:一周中的第幾天 (0: 周一)
# quarter: 第幾個季度
# is_leap_year: 是不是閏年

In [53]:
df['date'].dt.dayofyear[0]

1

In [54]:
df['date'].dt.is_leap_year[0]

False

In [32]:
# resample (is a time-based groupby)
# groupby一段時間去做agg

rng = pd.date_range("1/1/2012", periods=100, freq="S") #生成100筆紀錄，以每1秒為單位

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts

2012-01-01 00:00:00    132
2012-01-01 00:00:01     47
2012-01-01 00:00:02    140
2012-01-01 00:00:03    173
2012-01-01 00:00:04     59
                      ...
2012-01-01 00:01:35    234
2012-01-01 00:01:36    156
2012-01-01 00:01:37    444
2012-01-01 00:01:38    205
2012-01-01 00:01:39    143
Freq: S, Length: 100, dtype: int32

In [34]:
ts.resample("1Min").sum() #以每1分鐘做groupby去sum數值

2012-01-01 00:00:00    14823
2012-01-01 00:01:00    11108
Freq: T, dtype: int32

In [55]:
df = pd.DataFrame({
    'date': pd.date_range("2019/1/1", periods=365, freq="D"),
    'value': np.random.randint(1000, 5000, 365)
})

df

          date  value
0   2019-01-01   2873
1   2019-01-02   3990
2   2019-01-03   2383
3   2019-01-04   3808
4   2019-01-05   2278
..         ...    ...
360 2019-12-27   4371
361 2019-12-28   2727
362 2019-12-29   2066
363 2019-12-30   3974
364 2019-12-31   4540

[365 rows x 2 columns]

In [56]:
# 計算每個季度的平均
df.resample('Q', on = 'date')['value'].mean() #如果索引为Datetime index，则on不需要指定，默认依据索引进行resample

# Q: 季度
# M: 月份
# W: 星期
# ND: N天 
# H: 時
# T: 分

date
2019-03-31    3014.177778
2019-06-30    2914.164835
2019-09-30    2848.739130
2019-12-31    3038.010870
Freq: Q-DEC, Name: value, dtype: float64

In [67]:
# 當sample的频率低于原有的频率時，不夠的地方會填充NaN
df = pd.DataFrame(
    {'value': np.random.randint(1000, 5000, 2)},
    index = pd.date_range("2019/1/2", periods=2, freq="D")
)

df

            value
2019-01-02   4132
2019-01-03   4595

In [72]:
df.resample('6H').asfreq() #对resample后的结果应用.asfreq()会返回新频率下的series

                      value
2019-01-02 00:00:00  4132.0
2019-01-02 06:00:00     NaN
2019-01-02 12:00:00     NaN
2019-01-02 18:00:00     NaN
2019-01-03 00:00:00  4595.0

In [74]:
# 針對這些NaN，可以用.bfill()向前填充 or .ffill()向後填充 進行填充
df.resample('6H').bfill()

                     value
2019-01-02 00:00:00   4132
2019-01-02 06:00:00   4595
2019-01-02 12:00:00   4595
2019-01-02 18:00:00   4595
2019-01-03 00:00:00   4595

In [75]:
df.resample('6H').ffill()

                     value
2019-01-02 00:00:00   4132
2019-01-02 06:00:00   4132
2019-01-02 12:00:00   4132
2019-01-02 18:00:00   4132
2019-01-03 00:00:00   4595

Categoricals (R的factor)

In [65]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], 
     "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)

df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [66]:
# 將欄位"raw_grade"的type轉成category
print(df.dtypes)

df["grade"] = df["raw_grade"].astype("category")

df["grade"]

id            int64
raw_grade    object
dtype: object

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [68]:
# 按照level做rename
df["grade"].cat.categories = ["very good", "good", "very bad"]

df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [70]:
df["grade"] = df["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"]
)

df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [71]:
#根據"grade"的level去排序，而不是index
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [72]:
#統計每個level的數量
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

cut & qcut 將連續型變數切為類別型變數 (離散化)
cut: 利用 數值區間 將數值分類
qcut: 利用 分位數 將數值分類

In [97]:
# cut
ages = [2, 18, 25, 27, 21, 23, 37, 31, 60, 45, 41, 32, 1000]

In [98]:
cats = pd.cut(ages, [-float("inf"), 18, 40, 60, float("inf")]) #包後不包前 EX:18包含在 -Inf~18 之間
cats

[(-inf, 18.0], (-inf, 18.0], (18.0, 40.0], (18.0, 40.0], (18.0, 40.0], ..., (40.0, 60.0], (40.0, 60.0], (40.0, 60.0], (18.0, 40.0], (60.0, inf]]
Length: 13
Categories (4, interval[float64, right]): [(-inf, 18.0] < (18.0, 40.0] < (40.0, 60.0] < (60.0, inf]]

In [99]:
# 給每一個區間label
cats = pd.cut(ages, [-float("inf"), 18, 40, 60, float("inf")],
              labels = ['youth', 'adult', 'middle', 'senior'])

cats

['youth', 'youth', 'adult', 'adult', 'adult', ..., 'middle', 'middle', 'middle', 'adult', 'senior']
Length: 13
Categories (4, object): ['youth' < 'adult' < 'middle' < 'senior']

In [100]:
# 查看每個區間的數目
pd.value_counts(cats)

adult     7
middle    3
youth     2
senior    1
dtype: int64

In [95]:
# qcut
data = np.random.randn(1000) #高斯分佈
cats = pd.qcut(data, 4) #按四分位數分類，也可以用[0, .25, .5, .75, 1.]
cats

[(-3.681, -0.688], (-3.681, -0.688], (-0.688, 0.0106], (0.0106, 0.682], (0.0106, 0.682], ..., (-0.688, 0.0106], (-0.688, 0.0106], (0.682, 3.141], (0.682, 3.141], (0.0106, 0.682]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.681, -0.688] < (-0.688, 0.0106] < (0.0106, 0.682] < (0.682, 3.141]]

In [96]:
# 查看每個區間的數目
pd.value_counts(cats)

(-3.681, -0.688]    250
(-0.688, 0.0106]    250
(0.0106, 0.682]     250
(0.682, 3.141]      250
dtype: int64

資料匯出、讀取

In [74]:
# Getting data in/out

df.to_csv("foo.csv")

df = pd.read_csv("foo.csv")

df

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad